In [2]:
# Dependencies and Setup
import pandas as pd

# Files to Load
efficiency_to_load = "EV_range_efficiency.csv"
registration_to_load = "ev_registration.csv"
sales_to_load ="pev_sales.csv"

In [3]:
# Read the data into a Pandas DataFrame
efficiency_df = pd.read_csv(efficiency_to_load)
registration_df = pd.read_csv(registration_to_load)
sales_df = pd.read_csv(sales_to_load)

In [4]:
# Determine if there are any missing values. 
efficiency_df.count()

Model Year    123
Make          123
Model         123
Range         123
dtype: int64

In [5]:
# Determine if there are any missing values. 
registration_df.count()

State                   52
 Registration Count     52
dtype: int64

In [6]:
# Determine if there are any missing values. 
sales_df.count()

Vehicle    56
Type       55
2011       56
2012       56
2013       56
2014       56
2015       56
2016       56
2017       56
2018       56
2019       56
Total      56
dtype: int64

In [7]:
# Check Columns
registration_df

                   State  Registration Count
0                Alabama                2,890
1                 Alaska                  940
2                Arizona               28,770
3               Arkansas                1,330
4             California              425,300
5               Colorado               24,670
6            Connecticut                9,040
7               Delaware                1,950
8   District of Columbia                2,360
9                Florida               58,160
10               Georgia               23,530
11                Hawaii               10,670
12                 Idaho                2,300
13              Illinois               26,000
14               Indiana                6,990
15                  Iowa                2,260
16                Kansas                3,130
17              Kentucky                2,650
18             Louisiana                1,950
19                 Maine                1,920
20              Maryland               17,970
21         Massachusetts               21,010
22              Michigan               10,620
23             Minnesota               10,380
24           Mississippi                  780
25              Missouri                6,740
26               Montana                  940
27              Nebraska                1,810
28                Nevada               11,040
29         New Hampshire                2,690
30            New Jersey               30,420
31            New Mexico                2,620
32              New York               32,590
33        North Carolina               16,190
34          North Dakota                  220
35                  Ohio               14,530
36              Oklahoma                3,410
37                Oregon               22,850
38          Pennsylvania               17,530
39          Rhode Island                1,580
40        South Carolina                4,390
41          South Dakota                  410
42             Tennessee                7,810
43                 Texas               52,190
44                  Utah               11,230
45               Vermont                2,230
46              Virginia               20,510
47            Washington               50,520
48         West Virginia                  600
49             Wisconsin                6,310
50               Wyoming                  330
51                 Total            1,019,260

In [31]:
# Check Columns
sales_df.head()

,Vehicle,Type,2011,2012,2013,2014,2015,2016,2017,2018,2019,Total
0,Chevy Volt,PHEV,"7,671","23,461","23,094","18,805","15,393","24,739","20,349","18,306","4,915","156,733"
1,Nissan Leaf,EV,"9,674","9,819","22,610","30,200","17,269","14,006","11,230","14,715","12,365","141,888"
2,Smart ED,EV,342,139,923,"2,594","1,387",657,544,"1,219",680,"8,485"
3,Mitsubishi I EV,EV,76,588,"1,029",196,115,94,6,-,-,"2,104"
4,BMW Active E,EV,-,673,-,-,-,-,-,-,-,673

In [32]:
# Check Columns
efficiency_df.head()

   Model Year                 Make            Model  Range
0        2002                 Ford            Th!nk     50
1        2008                Tesla         Roadster    220
2        2010                Tesla         Roadster    200
3        2011                  BMW         Active E     94
4        2011  Azure Dynamics/Ford  Transit Connect     52